---
kind: property
id: P:Autodesk.Revit.DB.Architecture.PostPattern.StartPost
source: html/66b6c474-ba3a-6924-b00c-41b31702caf0.htm
---
# Autodesk.Revit.DB.Architecture.PostPattern.StartPost Property

Accesses the object containing properties related to the start post.

## Syntax (C#)
```csharp
public BalusterInfo StartPost { get; }
```